#+TITLE: モジュール分割された日本語対話システムの研究
#+SUBTITLE: 
#+AUTHOR: 江畑 拓哉
# This is a Bibtex reference
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil arch:headline ^:nil
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:nil e:nil email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:nil title:t toc:t todo:t |:t
#+LANGUAGE: ja
#+SELECT_TAGS: export 
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.1.4)
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper, dvipdfmx]
#+LATEX_HEADER: \usepackage{amsmath, amssymb, bm}
#+LATEX_HEADER: \usepackage{graphics}
#+LATEX_HEADER: \usepackage{coins-jp}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{times}
#+LATEX_HEADER: \usepackage{longtable}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{fancyvrb}
#+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \usepackage{pxjahyper}
#+LATEX_HEADER: \hypersetup{colorlinks=false, pdfborder={0 0 0}}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[backend=biber, bibencoding=utf8, style=authoryear]{biblatex}
#+LATEX_HEADER: \usepackage[top=30truemm, bottom=30truemm, left=25truemm, right=25truemm]{geometry}
#+LATEX_HEADER: \usepackage{ascmac}
#+LATEX_HEADER: \usepackage{algorithm}
#+LATEX_HEADER: \usepackage{algorithmic}
#+LATEX_HEADER: \addbibresource{reference.bib}
#+LATEX_HEADER: \advisor{Claus Aranha 櫻井鉄也}
#+LATEX_HEADER: \heiseiyear{30}
#+LATEX_HEADER: \majorfield{知能情報メディア主専攻}
#+LATEX_HEADER: \patchcmd{\abstract}{\Large}{}{}{}
#+DESCRIPTION:
#+KEYWORDS:
#+STARTUP: indent overview inlineimages
*** testcode :noexport:
#+begin_src python :results output
import numpy as np
t = np.array([1.0, 0.0])
y1 = np.array([0.8, 0.2])
y2 = np.array([0.6, 0.4])
def cross_entropy_error(y, t):
  delta = 1e-7
  return -np.sum(t * np.log(y + delta))

print('y1 : ', cross_entropy_error(y1, t))
print('y2 : ', cross_entropy_error(y2, t))
#+end_src

#+RESULTS:
: y1 :  0.22314342631421757
: y2 :  0.510825457099338

#+LATEX: \newpage
* C++ コードをEmacs + Org mode で書く :noexport:
#+CAPTION: テストコード
#+header: :includes <iostream>
#+header: :var greet="Hello World"
#+begin_src C++ :exports both :results latex :cache yes
std::cout << greet << std::endl;
#+end_src

#+RESULTS[72a19f4e33f7ff6180eab6e0536194c82f003d2c]:
#+BEGIN_EXPORT latex
Hello World
#+END_EXPORT

#+CAPTION: init.el
#+BEGIN_SRC emacs-lisp

(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted")))

(require 'org)
(require 'ox-latex)
(require 'ox-bibtex)
(require 'org-ref)
(setq org-latex-toc-command 
"\\thispagestyle{empty} 
 \\clearpage
\\include{abstract}
\\thispagestyle{empty}
\\clearpage
\\pagenumbering{roman} 
\\tableofcontents
 \\clearpage \\listoffigures \\clearpage")

(setq org-format-latex-options 
  (plist-put org-format-latex-options :scale 2.0))

(setq bibtex-completion-pdf-open-function 'org-open-file)

(setq org-latex-listings 'minted)

(setq org-latex-minted-options
      '(("frame" "lines") ("linenos=ture")
        ("obeytabs") ("tabsize=4")))

(setq org-latex-pdf-process
      '("platex --shell-escape --kanji=utf-8 %f"
        "platex --shell-escape --kanji=utf-8 %f" 
        "biber %b"
        "platex --shell-escape --kanji=utf-8 %f" 
        "dvipdfmx %b"))


(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)))
#+END_SRC

#+CAPTION: 書き方
#+BEGIN_SRC text
#+CAPTION: テストコード
#+header: :includes <iostream>
#+header: :var greet="Hello World"
,#+begin_src C++ :exports both :results latex :cache yes
std::cout << greet << std::endl;
,#+end_src

#+RESULTS[72a19f4e33f7ff6180eab6e0536194c82f003d2c]:
,#+BEGIN_EXPORT latex
Hello World
,#+END_EXPORT
#+END_SRC








